================================================================================
Function call with no arguments
================================================================================

count()

--------------------------------------------------------------------------------

(query
  (pipeline
    (function_call
      (function_name
        (identifier)))))

================================================================================
Function call with unnamed argument
================================================================================

count(host)

--------------------------------------------------------------------------------

(query
  (pipeline
    (function_call
      (function_name
        (identifier))
      (function_arguments
        (unnamed_function_argument
          (expression
            (identifier)))))))

================================================================================
Function call with named argument
================================================================================

groupBy(field=host)

--------------------------------------------------------------------------------

(query
  (pipeline
    (function_call
      (function_name
        (identifier))
      (function_arguments
        (named_function_argument
          (field_name
            (identifier))
          (expression
            (identifier)))))))

================================================================================
Namespaced function call (text:contains)
================================================================================

text:contains(field_name, substring="Substr")

--------------------------------------------------------------------------------

(query
  (pipeline
    (function_call
      (function_name
        (namespaced_identifier))
      (function_arguments
        (unnamed_function_argument
          (expression
            (identifier)))
        (named_function_argument
          (field_name
            (identifier))
          (expression
            (quoted_string)))))))

================================================================================
Namespaced function call (array:append)
================================================================================

array:append(arr, values=["a"])

--------------------------------------------------------------------------------

(query
  (pipeline
    (function_call
      (function_name
        (namespaced_identifier))
      (function_arguments
        (unnamed_function_argument
          (expression
            (identifier)))
        (named_function_argument
          (field_name
            (identifier))
          (expression
            (array_expression
              (expression
                (quoted_string)))))))))

================================================================================
Namespaced function in eval shorthand with if()
================================================================================

#repo=main #is_canonical=true CANONICAL-SERVICE-LINE: | a:=if(text:contains(field_name, substring="Substr"), then=1, else=0)

--------------------------------------------------------------------------------

(query
  (pipeline
    (filter
      (and_filter
        (field_comparison
          (field_name
            (identifier))
          (equality_pattern
            (anchored_pattern
              (identifier))))
        (field_comparison
          (field_name
            (identifier))
          (equality_pattern
            (anchored_pattern
              (identifier))))
        (free_text_pattern
          (unquoted_pattern))))
    (eval_function_shorthand
      (field_name
        (identifier))
      (function_call
        (function_name
          (identifier))
        (function_arguments
          (unnamed_function_argument
            (expression
              (function_call
                (function_name
                  (namespaced_identifier))
                (function_arguments
                  (unnamed_function_argument
                    (expression
                      (identifier)))
                  (named_function_argument
                    (field_name
                      (identifier))
                    (expression
                      (quoted_string)))))))
          (named_function_argument
            (field_name
              (identifier))
            (expression
              (number)))
          (named_function_argument
            (field_name
              (identifier))
            (expression
              (number))))))))

================================================================================
Function call with multiple arguments
================================================================================

groupBy(field=host, function=count())

--------------------------------------------------------------------------------

(query
  (pipeline
    (function_call
      (function_name
        (identifier))
      (function_arguments
        (named_function_argument
          (field_name
            (identifier))
          (expression
            (identifier)))
        (named_function_argument
          (field_name
            (identifier))
          (expression
            (function_call
              (function_name
                (identifier)))))))))
